# CeramicPatternAmount Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Ceramic..::..CeramicPatternAmount Property
Ceramic Class See Also
---
The property labeled "Amount" from the "Ceramic" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string CeramicPatternAmount { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CeramicPatternAmount As String
	Get
```

Visual C++
---
```text
public:
static property String^ CeramicPatternAmount {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 2".
# See Also
Ceramic Class
Autodesk.Revit.DB.Visual Namespace